89yanyu/STM32F103_Project/Encoder2/MYLIB/timer.c
#include "timer.h"
#include "stm32f10x_tim.h"

Timer_HandlerFunc Handler = NULL;

void Timer_Init()
{
    TIM_TimeBaseInitTypeDef TimerInitStruct;
    NVIC_InitTypeDef NVICInitStruct;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

    TimerInitStruct.TIM_Period = 65535;
    TimerInitStruct.TIM_Prescaler = 7199;
    TimerInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
    TimerInitStruct.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM3, &TimerInitStruct);

    TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);

    NVICInitStruct.NVIC_IRQChannel = TIM3_IRQn;
    NVICInitStruct.NVIC_IRQChannelPreemptionPriority = 3;
    NVICInitStruct.NVIC_IRQChannelSubPriority = 3;
    NVICInitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVICInitStruct);

    TIM_Cmd(TIM3, ENABLE);

}

void Timer_SetHandler(Timer_HandlerFunc func)
{
    Handler = func;
}

void TIM3_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
    {
        if (Handler != NULL)
        {
            Handler();
        }
        TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
    }
}
